Final/Supersonic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          880;
        startFace       1652;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          16;
        startFace       2532;
    }
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          880;
        startFace       2548;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       3428;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          16;
        startFace       3468;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       3484;
    }
    wall
    {
        type            wall;
        physicalType    patch;
        nFaces          104;
        startFace       3524;
    }
)

// ************************************************************************* //
